app/controllers/admin_controller.rb

SELECT "products".* FROM "products"
---
  def new
    @products = Product.all

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 28]]
UPDATE "products" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["name", nil], ["description", nil], ["updated_at", "2015-12-03 20:51:57.949843"], ["id", 28]]
---
  def update
    @product                        = Product.find(params[:id])
    @product.name                   = params[:product][:name]
    @product.description            = params[:product][:description]
    # REVIEW: You can do 'mass assignement' with @product.update(params.require(:product).permit(:name, :description))
    if @product.save