app/controllers/orders_controller.rb

  def show
    @current_user = User.find(session[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 35]]