app/controllers/products_controller.rb

  def index
    @products = Product.all
    if session[:id]
      @current_user = User.find(session[:id])
---
SELECT "products".* FROM "products"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 9]]

  def create
      @product = Product.new(product_params)
      @product.save
---
INSERT INTO "products" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "blah"], ["description", "blah"], ["created_at", "2015-12-01 00:00:47.678278"], ["updated_at", "2015-12-01 00:00:47.678278"]]

  def delete
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 17]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 17]]

  def show
    @product = Product.find(params[:id])
    @product_options = ProductOption.all
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 34]]
SELECT "product_options".* FROM "product_options"