app/controllers/product_options_controller.rb

  def index

    @product_options = ProductOption.all
    @product = Product.find(params[:id])
---
SELECT "product_options".* FROM "product_options"
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 19]]

  def create
      @product = Product.find(params[:id])
      @product_options = ProductOption.new(product_options_params)
      @product_options.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 0]]
INSERT INTO "product_options" ("name", "price_in_cents", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "green"], ["price_in_cents", 600], ["product_id", 0], ["created_at", "2015-12-03 22:38:40.865373"], ["updated_at", "2015-12-03 22:38:40.865373"]]

  def delete
    @product_option = ProductOption.find(params[:id])
    @product_option.destroy
---
SELECT  "product_options".* FROM "product_options" WHERE "product_options"."id" = $1 LIMIT 1  [["id", 11]]
DELETE FROM "product_options" WHERE "product_options"."id" = $1  [["id", 11]]