app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "karen@donutville.com"], ["created_at", "2015-11-30 22:15:58.754434"], ["updated_at", "2015-11-30 22:15:58.754434"]]

  def show
    @current_user = User.find(session[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 36]]